Revit 2027 API
DimensionType.CanHaveOrdinateDimensionSetting Method
 Checks whether this DimensionType can have an ordinate dimension settings.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool CanHaveOrdinateDimensionSetting()
Public Function CanHaveOrdinateDimensionSetting As Boolean
public:
bool CanHaveOrdinateDimensionSetting()
member CanHaveOrdinateDimensionSetting : unit -> bool
Return Value
Boolean
 True when the DimensionType is linear and the Dimension String Type parameter is ordinate, false otherwise.
Remarks
 It returns true when the DimensionType is linear and when Dimension String Type parameter is set to Ordinate.
See Also
Reference
DimensionType Class
Autodesk.Revit.DB Namespace